{"motivationalQuotes": ["https://tenor.com/view/do-it-star-wars-gif-4928619", "Push yourself, because no one else is going to do it for you.", "If you see a chance to be kind to someone tomorrow, take it. I think we need it. -Brad Pitt", "If you don't design your own life plan, chances are you'll fall into someone else's plan. And guess what they have planned for you? Not much.", "Life is 10% what happens to you and 90% how you react to it.", "Problems are not stop signs, they are guidelines. -Elon Musk", "If you fell down yesterday, stand up today. -H.G. Wells", "Education is the passport to the future, for tomorrow belongs to those who prepare for it today. — Malcolm X", "Education is the most powerful weapon you can use to change the world.", "A person who never made a mistake never tried anything new. — Albert Einstein", "Learning is never done without errors and defeat. – Vladimir Lenin", "Procrastination makes easy things hard and hard things harder.", "You don’t have to be great to start, but you have to start to be great.", "The way to get started is to quit talking and begin doing. – Walt Disney", "The best way to predict your future is to create it. —Abraham Lincoln", "The future belongs to those who believe in the beauty of their dreams. ― Eleanor Roosevelt", "You are braver than you believe, stronger than you seem and smarter than you think.", "Learn from yesterday. Live for today. Hope for tomorrow. – Albert Einstein", "He who asks a question is a fool for five minutes; he who does not ask a question remains a fool forever. — Chinese Proverb"], "teacherQuotes": ["\"Waiting for...\" \"What's the move guys?!\" - <@!404717378715385856>", "\"What the heck is this head thing? Nobody told me about that\" - Evett", "\"Waiting for... \"What's the move guys\"\" - <@!404717378715385856>", "\"When I leave this lecture I forget\" - Maniccam", "\"Man I'm thirsty\" \"Ya and I'm tired\" - Mayhem and Maniccam", "\"Maniccome\" - @Jesse with an E", "\"The two scores above 80% for this quiz are from one boy and from one girl. * Points at me and other student. * That shows you all, that programming is not sexist, and that you are all just bad.\" - Zhang", "\"You reign is over, Jesse!\"...  \"How can it be over when it never even began?\" - Faizan and Sara", "\"(Class ends at 9pm) Me: Oh wow, it's only 9:30? Class finished early tonight!\" - @Alex Pilon", "\"@allthefoolsinthischat\" - <@!342927159968399370>", "\"A law that happens to be true, which is wonderful I think?\" - Rita", "\"After 314 is turned in tonight... Im opening a drink to toast\" - Unknown", "\"All companies are headless flies\" - Zhang", "\"All you have to do is just kill it\" - Maniccam", "\"At least I know you are alive in the meeting\" - Jiang", "\"At least I'm not drawing a pp on the pp\" - <@!340690145324040192>", "\"Awesome sauce\" - Evett", "\"Bahorski made a Ba-oopsie\" - <@!695099972139352074>", "\"Because I hate all people and life\" - <@695099972139352074>", "\"Bruh who thrashed you in your dream? It better not be me cuz I was going places last night 😂\" - <@405098410757193729>", "\"Caw caw motherfucker\" - <@!262729556304199692>", "\"Credits?!  What are credits?!\" - <@!404717378715385856>", "\"Damn. If all I needed to do to get a Shiny was feed my mon LSD I'd be swimming in them by now.\" - <@262729556304199692>", "\"Dang I go to work for a few hours and suddenly I'm Brendan\" - Anon", "\"Did I ruin the moment we were all having?\" - Alex", "\"Yaaa...\" - Manny", "\"Disney++? Are we incrementing Disney now?\" - @Jesse with an E", "\"Does giving up on it count as progress? Cause if so then yes.\" - <@!400300608898465792>", "\"Don't argue if you cheat, or have no idea what you're doing\" - Zhang", "\"Don't freak me out and copy and paste wrong\" - <@!404717378715385856>", "\"Draw on your screen with a permanent marker\" - Evett", "\"Enough is enough... SHUT UP\" - Zhang", "\"Get Fucked Everyday (not literally)\" - Scoop Catt", "\"Give me a smart idiot over a stupid genius any day\" - Samuel Goldwyn", "\"Give me all the candies\" - Maniccam", "\"Grammar is overrated until you miss a semicolon and your program doesn’t work at all.\" - <@!405098410757193729>", "\"Had a feeling some of you were dreaming\" - Maniccam", "\"Have you read about me?\" - Bill", "\"He's gonna squeeze me dry then tell me to fuck off lmao\" - <@!223937816483069952>", "\"Hello you see me 5pm Friday. Bring money at 10 dollars.\" - Maniccam", "\"How can I make that mistake?!\" - Zhang", "\"Hump day?? More like Slump day\" - <@!695099972139352074>", "\"I am being productively unproductive\" - Anon", "\"I am the one who Zhangys\" - Jesse Heisenberg", "\"I at least want the opportunity to be thrown into a labor camp for expressing my views freely\" - @Ryan Kim", "\"I bet Maniccam's name was originally spelled with one 'c' but he added a second one because he loves C so much\" -  <@!695099972139352074>", "\"I came in with zero credits, and I plan to leave with zero credits\" - <@!404717378715385856>", "\"I currently have popcorn in the microwave so I can eat to this train wreck of a lesson.\" - <@!628643213900775454>", "\"I didn't do my job and grade your hw\" - Maniccam", "\"I don't know how many of us run a candy store\" - Maniccam", "\"I don't quite understand what's going on here, and I want to explain it to you\" -Bill", "\"I don't think your subconscious is smart enough to talk while you are ded\" - <@!405098410757193729>", "\"I don't... I don't like this. People can misinterpret this, get into fist fights with one another.\" - Maniccam", "\"I feel like it should be illegal for a class to be this boring\" - <@!688751253316173861>", "\"I figured it out... Turns out I am high\" - <@!404717378715385856>", "\"I got fucked sideways by the exam.\" - <@!628643213900775454>", "\"I gotta trust the person... Or this baby aint getting adopted\" - <@!404717378715385856>", "\"I have a class to attend to... I have to go\" - <@!405098410757193729> at 1:36pm", "\"I have been kicked enough, it's time to do the kicking\" - <@!223937816483069952>", "\"I have the grades updated but I forgot to post them\" - Zhang", "\"Idiot party\" - <@!355928972917211147>", "\"If EMU had a 50 shades of Grey version, it would be Manny\" - @Faizan Mo Akheel", "\"If I could hear my health it would probably be cussing me out on a daily basis\" - @Jesse with an E", "\"If none of us answer any questions, we get 100%\" - @Colin Wilson", "\"If someone tells you they like recursion then they are either lying to you, themselves or both.\" - <@!223937816483069952>", "\"If you aren't sleepy you can hit this button.\" - Maniccam", "\"If you find my mouse, please let me know\" - Beiyu Lin", "\"Its only filter or map.... But I dont know which one\" - Zhang", "\"Just pull yourself up by the bootstraps, find a picture of an emu degree on the internet, photoshop your name on it, and print it out\" - <@!743957184924352542>", "\"Keep those memes going. You get to leave old people like me in the dust\" - Evett", "\"Knock knock\" \"Who's there?\" \"Go fuck yourself!\" - Catch Me If You Can", "\"Left handed people who's left hands are predominant\" - Rita", "\"Let's be real: All CS Students procrastinate big time. We are all, in our own ways, suffering with some shit.\" - <@!405098410757193729>", "\"Lol spelling is overrated until I spell all my variables wrong and nothing works. But I'll take that over essays anyday\" - <@!355928972917211147>", "\"Master.. Copier\" - Zhang", "\"Mathematical... Theoretical... Stuff...\" - Maniccam", "\"Maybe burn recursion with hairspray and a lighter.\" - <@!223937816483069952>", "\"Maybe they are watching tv or somethin and he just got it out...\" - <@!695099972139352074>", "\"My fingers are not working today\" - Maniccam", "\"New blah blah blah\" - Maniccam", "\"Now to hide the dead bodies...\" - <@!404717378715385856>", "\"I hope I entered it correctly!\" - Rita", "\"I hope i copied that right\" - Rita", "\"I run my damn loop on it\" - Maniccam", "\"I see someone in the chat commented, 'LETSSSS GOOO' ...Do you want to go?\" - Jiang", "\"I think all comp sci tests are the built up wraith professors get from reading our code.\" - @ParkerAllen", "\"I want you to suffer a little bit\" - Maniccam", "\"I was trying to think of the phrase serial number but instead I just said a computer has a social security number\" - <@!693192159909642273>", "\"I will give you a dirty little secret... actually, the secret is there is no secret\" -Maniccam", "\"I'll tell the grader to get around to it! Pertaining to the quizzes we took, waiting on grades before we take our final exam in literally 1 week\"-Kashliev", "\"I'll upload this windows which I downloaded in 1999!\" - Zhang", "\"I'm basically killing the screen\" - Maniccam", "\"I'm going to delete all the Tom's\" - Maniccam", "\"I'm just gonna make this interestingly complicated\" - Zhangy", "\"I'm lazy, I just copy your answer\" - Zhang", "\"I'm not kicking anyone but myself\"- <@!693192159909642273>", "\"I'm the law\" - Ryan Kim while kicked", "\"It's sooo simple\" - Zhang", "\"Oh!?  So what am I doing wrong!? ........... Unless my calculator is running out of juice!  That might be the case.\" - Rita", "\"Ohhh it takes too many steps\" - Zhang", "\"Old Old Old Old Lisp... Works!\" - Zhang", "\"Overworked and underpaid\" - <@!743957184924352542>", "\"Please do not sit there and do nothing\" - Maniccam", "\"Please don't forget to give me admin access before you die\" - <@!405098410757193729>", "\"Praise-Harrold 🙌\" - <@!695099972139352074>", "\"Recursion is not friendly\" - Zhang", "\"Run faster gerbils\" - Evett", "\"Say you want to delete Tom\" - Maniccam", "\"She is always high, but yeah she probably snorted something really strong today\" - <@!405098410757193729>", "\"Sometimes cheaters do prosper\" - <@!743957184924352542>", "\"Sometimes it's the backward pump that gets you out of trouble\" -Sverdlik", "\"Soon I will become a frog\" - Alex", "\"Stuck with my cute but stupid baby at home\" -Jiang", "\"Suck itttttt\" - <@!695099972139352074>", "\"TEASTTTT\" - <@!404717378715385856>", "\"Talk to someone, you just don't want to learn it\" - Zhang", "\"Thanks man for volun-fucking me over\" - One of Brendan's HS students", "\"That would be a lot of writing and I didn't want to do a lot of writing\" - @Jessy with a Y", "\"That's the smell of freedom in Texas\" - Evett", "\"There may be 5 people whose name is Tom\" - Maniccam", "\"There's something to be said about someone who can achieve good results with procrastination. It shows good time/deadline management because you know how much you can get away with\" - Anon", "\"These formulas have been derived by guys who are just... brains, so we just have to use them\" -Rita", "\"This is where the pain is going to start\" - Maniccam", "\"This lisp is so horrible\" -Zhang", "\"This tells you... Don't be smart in your own way\" - Zhang", "\"This verifies that I did things correctly on my end\" - Rita", "\"To understand recursion, one must first understand recursion\" - STM32CubeIDE", "\"I hear you are a fan of shooting balls.  Care to join?!\" - <@!340690145324040192>", "\"I thought you were gonna tell me the broccoli wouldn't build, I was gonna be fuckin' disappointed\" - <@!293482309296848896>", "\"I would die for cake\" - <@!242861512618803201>", "\"I'm borderline a nice person lol, mixed with being a pussy\" - <@!446768827448033290>", "\"I'm here to code and kick ass..... and my code isn't working\" - <@!206236569286344706>", "\"I'm high on java atm\" - <@!405098410757193729>", "\"I'm in class you nitwit\" - <@!206236569286344706>", "\"I'mma start digging my grave now\" - <@!242861512618803201>", "\"I've tuned out this lecture tbh... When he asked \"Come on guys what do you see?\" I tune into some strange eldritch writing and just sigh.\" - <@!247538799700082688>", "\"If you try hard you can put 24k here and become a billionaire.\" - Maniccam", "\"Im about to mute my camera\" - <@!695099972139352074>", "\"In order to cheat... you have to know it\"  \"If you're dumb dont cheat...\" - Zhang", "\"It wont run in the editor... But it will run perfectly in my mind\" - Zhang", "\"It's 5:18 in the morning. Just get done bitch\" - <@!405098410757193729>", "\"It's due sometime at the end of the semester\" - Kasliev", "\"It's gonna ask how much you have, I've got nothing.\" - Maniccam", "\"It's not gonna crash your program, probably\" - Maniccam", "\"Its not STATISTICS, its how to solve word problems with shitty calculators\" - <@!460882291045040142>", "\"L.I.S.P (Lots of Idiot, Stupid Parenthesis)\" - <@!693192159909642273>", "\"Li Zhang, the Fortran K-9\" - <@!695099972139352074>", "\"Maniccam here I Mani-come\" - <@695099972139352074>", "\"Maniccam's voice is like sandpaper\" - <@!206236569286344706>", "\"Maniccome\" - <@206236569286344706>", "\"Might give myself a haircut during 423 today\" - <@!693192159909642273>", "\"My grade is so low that I am not sus\" - <@!404717378715385856>", "\"Oh I'm not muted\" - <@!558107387395964932>", "\"Smashed that 'Leave' button so hard I think I fractured my fingie\" - <@!695099972139352074>", "\"Something's not right\" - Zhang talking about Lisp 😂", "\"The gutter is not where I'm trynna be\" - Annon", "\"The numbers in Canvas are irrelevant\" -Evett", "\"The risk I took was calculated, but man, am I bad at math.\" - <@!223937816483069952>", "\"Those balls are gonna be hitting hard\" - <@!223937816483069952>", "\"Try lisp for fun\" - Zhang", "\"Well you have a macbook and macbooks are absolutely unserviceable unless you take it to an Apple Store and pay $200 along with your dog for some intern to throw in a stick of RAM. Get got.\" - <@!206236569286344706>", "\"When u are awake but missed everything\" - <@!242861512618803201>", "\"You are summoned to make cursed roblox\" - <@!340690145324040192>", "\"You're nothing less than a predator\" - <@!405098410757193729>", "\"Zhang's voice is as smooth as an angels bottom\" - <@!206236569286344706>", "\"Epic balls dude\" - <@!293482309296848896>", "\"Final regards: if you're a robot with a bulletproof attention span and IQ level of 200 you probably did fine on the exam\" - <@!206236569286344706>", "\"My new tab page wants me to eat either myself or Alex\" - <@!206236569286344706>", "\"No spelling skillz\" - <@!355928972917211147>", "\"Plus tbh the internet is so big that if you can think it, it probably exists\" - <@!629900384642793472>", "\"I am confident, no one in your jobs as good at recursion than me.\" - Li Zhang", "\"When you get confused by these big numbers, just think simple\" -Chaudhuri", "\"Wrong Wrong Wrong!!!\" - Zhang", "\"Yaaa...\" - Manny", "\"Yo I think I fucked up my soup\" - <@206236569286344706>", "\"You are not a robot, you should at least copy from a reliable source, and change it and understand it\" - Zhang", "\"You are probably saying 'You're just going willy nilly all over the place' and to that I'd say, you're right\" - Maniccam", "\"You can let shit happen 3 times\" - Maniccam", "\"You got this! You can survive. If you fail retake the class with Manny\" - <@!223937816483069952>", "\"You guys can take a 30-second break\" -Maniccam", "\"You ignore me, I ignore you\" - Zhang", "\"You know what doodle is? It's what you do when you don't want to listen to your teacher\" - Maniccam", "\"You like.. Robotic Agent\" - Zhang", "\"You only merge things you as a pewnie human can understand\" - Evett", "\"You think my dad would be mad if I paid my 200 dollar rent in dollar bills?\" - Anon", "\"You're a dumb ass you know that...?\" \"Affirmative\" - Brendan and Jesse", "\"Your hallucinating\" - Evett", "\"For (disney = 0; disney < DISNEYWORLD; disney++){  Sony--;   WarnerBrothers--;  Netflix--;  Hulu--;  MyHappyness++;}\" - @Sara S.", "\"My mind is polluted by lisp\" - Zhang", "\"Shaking babies is bad\" - @Ryan Kim", "\"The chad Sverdlik (married) vs the virgin Maniccam (probably divorced)\" - @Jesse with an E", "\"You can !clean my messages but you can never !clean your bad grammar\" - @Sakib Jabbar", "\"Answers will be correct if you do the problem correctly, that might not be the case if you do it incorrectly\" - Rita Chattopadhyay", "\"Being busy isn't always not nice\" - Kyle Bartush", "\"Bla\" - Maniccam", "\"Both are touching, but they are a different type of touching\" -S. Maniccam", "\"By You and me, I mean humans\" - Manniccam", "\"Canvas is the worst piece of garbage in the century\" - Zhang", "\"Cheat Smartly\" - Zhang", "\"Computer science majors, you know, geeks\" - Maniccam", "\"Computer science students have a license to bullshit\" - Maniccam", "\"DUMB CANVAS... JUST SO DUMB\" - Zhang", "\"Do it\" - Zhang", "\"Don't act like you guys are the only ones in my life\" - S. Maniccam", "\"Don't tell me something doesn't work, deal with your problems on your own\" - S. Maniccam", "\"Don't tell me you're confused. I don't want to hear the word confusion.\" - Maniccam", "\"Drawing is not good, don't pay attention to it\" - Rita Chattopadhyay As she continues to use the drawing in her lecture", "\"Drink coffee all day and you prove things\" - Maniccam", "\"Error on line 41, I dont wanna count these!\" - Zenia Bahorski", "\"Even if you so dumb, you can figure this out\" - Zhang", "\"Everyone should know this one, if you aren't dumb enough\" - Zhang", "\"Fans are an optional accessory\" - Ryan Kim when talking about PC building", "\"For the next two weeks... Completely ignore your past experiences in programming\" - Zhang", "\"For this one, I would say, just use your brain. Use your eyes.\" -S. Maniccam", "\"Forget about canvas, it doesn't need to mentioned, it's SO dumb\" - Li Zhang", "\"Fork a child\" -Evett", "\"From now on 4 consecutive recursion quizzes on Wednesday\" - Zhang", "\"Fuck binary trees, all my homies hate binary trees\" - Mr_J", "\"Grading Quizzes is so unproductive\" - Zhang", "\"Half of you will fail this class\" - every shitty professor ever", "\"Horrible code, this is just... Aweful code\" -Zhang", "\"How do I find the good N\" - William Sverdlik", "\"How do I pick the pivot?!\" - William Sverdlik", "\"How not to die poor\" - Maniccam", "\"I am not sure how much longer we will be here. This is a once in a century event\" - Zhang", "\"I can't believe society has lied to me. This is so new\" -Josh Roznowski", "\"I didn't pay much attention probably\" - Zhang ", "\"I don't care about the blah blah blah\" -S. Maniccam", "\"I don't even know what discord is. I don't want to know\" - Maniccam", "\"I don't think you are geeks, but sometimes you behave like the geeks\" - Li Zhang", "\"I don't want to be teaching this class but the department is forcing me to\" - Zhang", "\"I don't want to do marriage counseling\" - Maniccam", "\"I expect only 30% of you to still be in this room by the end of the semester\" - Zhang", "\"I expect this wednesday would be horrible\" - Li Zhang", "\"I have a lot of shit to do before 5:30. Bye.\" - Maniccam", "\"I have already cussed at zhang in 4 different languages. I am livid.\" - Faizan A. about Zhangs quizzes", "\"I have high expectations for this quiz this Wednesday, some of you... Will do just fine\" - Zhang", "\"I have no further comment. Wish I could say that to everybody\" - Maniccam", "\"I have to go home and figure this out\" - Maniccam", "\"I have to send an apology letter to my...\" Stops talking and continues to something else - Maniccam", "\"I just assume your answer come from aliens, from area 51\" - Li Zhang", "\"I like my hash with a little salt and pepper myself, but that's just me\" - Sverdlik", "\"I need to beat the crap out of some of you\" - Maniccam", "\"I say, you just in your orbit around your universe, that's it\" - Li Zhang", "\"I should write a booklet on recursion for dummies\" - Li Zhang", "\"I think I took an example from somewhere\" - Rita Chattopadhyay", "\"I think I'll play with this later.\" - Zenia Bahorski ", "\"I want to punch some of you in the face\" - S. Maniccam", "\"I'd rather a linked list pulled a bed sheet around my head and skull fucked me than to have to deal with another fucking BST\" - @Mr_J", "\"I'll do it next year\" - Li Zhang", "\"I'll probably blame Java.  Because recursion is unmanageable\" - Zhang", "\"I'm gonna leave. Everybody get out\" - Maniccam", "\"I'm not dreaming. I'm not smoking anything\" - Maniccam", "\"I'm not gonna have infinite lube(loop)\" -Maniccam", "\"If it was a banana, you would put the banana inside the list.\" -Maniccam", "\"If someone tells you they like recursion then they are either lying to you, themselves or both.\" - @Sara S.", "\"If you cannot prove this to me, that means we have failed\" - Maniccam", "\"If you don't know recursion, you are DOOMED!\" - Zhang", "\"In pseudocode this looks like ...\" and proceeds to write perfectly valid python code", "\"It is not my responsibility to fix problems\" - Maniccam", "\"It works! Of course it works. Because I'm so good\" - Zhang", "\"It's just amazing\" - Li Zhang", "\"It's not like you are married to this person for 20 years. You can override it\" - Maniccam", "\"It's okay, we are not abusing our child\" - S. Jiang", "\"Its so SIMPLE!  Just get it done!\" - Zhang", "\"Languages nowadays baby the programmer. C does not\" - Maniccam", "\"Let me look at your faces, man to man\" - Maniccam", "\"MORE EVIL PLAN\"", "\"Many books are garbage\" -Maniccam", "\"Maybe you can go home after listening to this part\" - Maniccam", "\"Mmm, this is good. This is good. I'm so smart.\" - Zhang", "\"My cat knows alot about recursion\"", "\"NOT MY PROBLEM\" - Zhang", "\"Never tell an accountant to write a for loop, he'll likely respond \"What the hell is this?\" \" - Maniccam", "\"Okay, I've seen enough\" -William Sverdlik", "\"Open your eyes real wide, slap yourself, and read it\" - Maniccam", "\"Parent may terminate execution of children\"  - Evett", "\"Poor thing is dead, IS DEAD!\" - Zhang when his SML compiler wouldn't work", "\"So have I convinced you all to become literature students yet?\" - Sverdlik", "\"So you're saying... bounce this guy, and this guy, upstairs?!\" - Sverdlik", "\"Some of you have probably heard bad things about me - some of those things are probably true.\" - Maniccam", "\"Some of you, you insult me, you treat me like nothing\" - Li Zhang", "\"Someone could give you a question to make your life miserable\" - Maniccam", "\"That's the only fun in my life, watching other people lose money.\" - Maniccam", "\"The answer is yes, so I kick the bigger one upstairs\" - Sverdlik", "\"The next time I ask, \"What's wrong with you guys?,\" you can just respond: \"We're vitamin D deficient!\" \"- Sverdlik", "\"The second type wasn't exactly soothing\" - Maniccam's ex wife probably", "\"There are lots of ways to make a person less than another\" -Bill", "\"There are two types of touching.\" - S. Maniccam", "\"There is a god\" - Maniccam", "\"This implemention is....hmmm...how do I say it....the most stupid implementation\" -Tong about his own code", "\"This is how to find the children\" - Sverdlik", "\"This is like grandma driving a car\" - Maniccam", "\"This is one of the worst displays of human insanity\" - Li Zhang", "\"This is so horrible\" -Zhang", "\"This is the worst software I've ever seen in this century\" - Zhang  ", "\"This is where things get really really funky\" - Sverdlik", "\"This smells like a math class\" - Maniccam", "\"This so dumb\" - L. Zhang", "\"Try your stupid approach and fail miserably, burn your life\" - Zhang", "\"Turn off your mic I don't want to hear your family members\" - Maniccam", "\"Turn on your camera so I can look you in your eyes\" - Sverdlik", "\"Two Two Two Two\" -Zhang", "\"UHHHHHhhhhhhhhhhhhhh...\" - Maniccam", "\"Wat da hell is the token type\" - Maniccam", "\"We are literally cheating our ways to a better future\" -Anonymous", "\"What a silly language, it cant figure that out for me?!\" - Sverdlik", "\"What does Eclipse look like?\" - Sverdlik", "\"What if I sent it... Whatever its called....\" - Zenia Bahorski", "\"When they invented 'tough,' they had Michigan people in mind. We wrestle bears and write code in Java.\" - William Sverdlik", "\"Wow I never knew anyone who was proud of being bad at their job\" - Things to say to make them squirm", "\"X could be an atom, it could be list, it could be banana or dog\" - Maniccam", "\"You and me are going to agree, well, I'm going to force you to agree\" - Maniccam", "\"You can proudly proclaim that you have a lisp\" - Li Zhang", "\"You can't keep blaming software\" - eydgahi", "\"You can't mute me, I am the law\" - Ryan Kim", "\"You cannot hide\" - Maniccam", "\"You guys are just great\" - Sverdlik", "\"You guys are supposed to be able to figure this out.  I shouldn't be showing you\" -Sverdlik", "\"You guys look like good students. Well, I don't know - I haven't looked at your quizzes. But last semester was not good.\" - Maniccam", "\"You guys think driving is piece of cake, open the car door, turn on ignition, and drive.\" - Maniccam", "\"You should change your major to music instead.\" - Maniccam (Fall 2019 after randomly bringing/playing a guitar in Professor Maniccam's 341) ", "\"You should go home and read it\" - Maniccam", "\"You're not a human\" - Li Zhang", "\"Zhang complaining about canvas ............. drinking game anyone?\" - Andreaka Jump", "\"Zhang probably eats recursion in all 3 meals and I wont be surprised\" - Faizan A.", "\"For few people I give up... grading so easy I cant find errors.. probably hire aliens to tele send you answers\" - Zhang", "\"If you are going to the facebook, they have all the data, they know how everyone is connected\" -S. Maniccam", "\"It's open book but not open friends\" - zhang", "\"Let's say I'm one of those idiots\" -Maniccam", "\"oooooooOOOOoooOO\" - Maniccam", "\"Parenthesisisis\" - Maniccam", "\"Push push push pop pop pop\" - Maniccam", "\"That's a you problem\" - @Ryan Kim", "\"The next section Im SUPPOSED to teach for this class\" - Rita Chattopadhyay", "\"This class got complicated quick. we're coding wholeass families now\" - <@!206236569286344706>", "\"This thing is so stupid...  so stupid\" -  Zhang", "\"We can just marathon run through this\" - Maniccam", "\"Well that's his problem\" - Maniccam", "\"Why do students play these games with me\" - Maniccam when one student is missing", "\"You probably hire some aliens to tele-send you the answers\" - Li Zhang", "\"Zwoop\" - Maniccam", "\"You should have gone into this last year\" - Every teacher ever", "\"Illegible text scribbled on the page.... \"Come on people, what does it say?!\" \" -Maniccam", "\"Wait a second!.... Are you telling me I made a mistake?!?\" - Sverdlik", "\"You won't have to worry about this until next year\" - The teacher last year", "\"Everybody likes to complain about everything\" -Maniccam", "\"Fun, lower level coding\" - Maniccam", "\"I don’t know how the complier is so dumb\" - Zhang", "\"Some of you don’t care...  you’re just writing stuff that only your cat would understand...\" ~ Zhang", "\"Take a brute force approach\" - Narayanan", "\"Worry about it when we get there\" - Maniccam", "\"Your mind is not correct\" - Zhang", "\"If someone tells you they like recursion then they are either lying to you, themselves or both.\" - <@!223937816483069952>", "\"Bill represents our confusion. Zhang represents our insanity. Maniccam represents our frustration and anger. These 3 are literally the holy trinity of compsci professors representing the emotional repercussions of being in computer science\" - Jesse in the COSC 311 Sverdlik channel", "\"You understand right? *(waits 1 second)*  Yeah, I'm sure you do.\" -Chaudhuri", "\"Nah idc I'm cold hearted I pour the milk first then the cereal\" - <@!342927159968399370>", "\"Start shooting the bird, ok\" - Maniccam", "\"Let me get serious and shoot this bird\" - Manny", "\"The bird is moving slowly so it's easy to shoot\" - Maniccam", "\"In order to get a new bird I need to shoot it\" - Maniccam", "\"you have a gun, you have a bullet, and a bird\" - Maniccam", "\"I need to know where the bullet is. I need to know where the gun is.\" - Maniccam", "\"Can you hear my squishy?!\" - <@776256478877057035>", "\"I'm here for the 5 points of extra credit, not to write good code\" - <@!431114639821242369>", "\"I love my squishy!  I have my squishy right here!\" - <@!776256478877057035>", "\"pseudo focusmode\" - <@!206236569286344706>", "Colin tries to ask about extending the hw. \"So to begin let's do some book keeping\" - Evett", "\"I'm gonna get a super A in this class\" - <@!223937816483069952>", "\"Exponential growth is a B****\" - Evett's lecture slides", "\"My suggestion would be to take a hammer to your dashboard, you can't have a check engine light come on if you don't have a check engine light\" - <@!743957184924352542>", "'Boys i think I just won. I told a girl I'm a discord admin and her ovaries exploded\" - <@!206236569286344706>", "\"I don't engage in criminal activities so I wouldn't know\" - Maniccam", "\"I will be dead, you will be dead, your kids will be dead\" -Maniccam", "\"I'm high on oxygen\" - <@!776256478877057035>", "\"Today i'm just going to give you a hard time\" - Maniccam", "\"Hopefully I'm dead before that happens\" - Maniccam talking about quantum computers", "\"Fancy pantsy things\" - Maniccam", "\"Forget everything you know about Java. Here's how to translate to SML from Java.\" - Zhang", "\"Software engineers? I prefer the term professional googlers\" - <@!206236569286344706>", "\"You have to decide how to play the game otherwise you are gonna get into fist fights\" - Maniccam", "\"There's someone knocking at the door, don't worry about it\" - Maniccam", "\"I will be dead soon\" - Manny", "\"Somebody shoot me and I die in 2 mins I don't mind\" - Manny", "\"I don't see your cameras on....well we'll go through the syllabus and you'll see what happens when your cameras arent on\" -Maniccam", "\"Yea I am breaking the rules\" - Maniccam", "\"How do I download an image?\" - Maniccam", "\"If you are falling asleep, it's time to wake up\" - Maniccam", "\"She thiccc\" - <@776256478877057035>", "\"Does anybody see where my mouse is?\" - Tehranipour", "\"What he's dead. I liked this guy\" - Maniccam", "\"I got it! I love my brain!\" -Mansour", "\"You can't even read your own damn program\" - Maniccam", "\"i don't like dealing with other people's code\" - computer science professor, whose job is to grade lots of code", "\"Yeah, every day I kill myself for wasting money on that stupid shit\" - <@!405098410757193729>", "\"This will kill some of you, but that does not matter\" -Zhang", "\"I have a head but its empty\" - Manniccam", "\"I have a life but it is empty\" - <@!405098410757193729>", "\"CSS is kind of stuffy\" - Maniccam", "\"CSS is like an onion. It never ends\" - Maniccam", "\"Whoever wrote this must have outsourced [Canvas] to completely ignorant people\" - Zhangy", "\"Pound banana will work\" - Maniccam", "\"I'm getting tired...\" -Manny", "\"You're already- *somehow* -pretty good..\" -Zhang", "\"Pure garbage. Absolutely trash.\" -Zhang", "\"Sometimes I have students that write their code in times new roman and I want to slap them\" - Maniccam", "\"I think my internet is about to tragically, suddenly, and unexpectedly die\" - <@!145271919250243585> during 436 with Maniccam", "\"Now we are experts on borders. what a fuckin accomplishment!\" - <@!405098410757193729>", "\"I only wish Manny recorded these lectures so I have something to help me get to sleep at night\" - <@!695099972139352074>", "\"Look I know that I am dumb, but I'm not that dumb\" - <@!223937816483069952>", "\"Might need a rowboat to get to class today\" - <@!341896667504836608>", "\"VSCode is more like an IDE\" - Jiang", "\"I don't think a solar event could be considered an ide, but that's some good thinking outside of the box\" - <@!495810260406239235>", "\"AWS 'KMS' -->\nsounds a lot like what imma do if we have a fuckin quiz today!\" - <@!695099972139352074>", "\"These slides aren't on canvas... That's what I was saying... But you have the knowledge now because you followed along in the lecture!\" - Kashliev", "\"Think like machine\" - Maniccam", "\"Both coding languages smell similar\" - Maniccam", "\"Don't care situation\" -Zhang", "\"C was designed by guys in a basement in the 70s, they weren't trying to be friendly\" - Manny", "\"Both of you, go to hell!\" -Zhang", "\"I'll have you know I graduated top of my class in \"Copy Paste from StackOverflow 101\" and my mom says I'm not a loser so idk what to tell you chief.\" - <@!211354491902099457>", "Just as a heads up due to how you formatted it, it won't be in the bot. Gotta do it like this \"quote\" - person", "\"They (Zhang's Quizzes) are meant to be hard and are meant to trick ... but if we don't get tricked ... we win\" - <@!160234128883580928>", "\"At some point we have to stop, but not today\" - Maniccam", "\"My body does not have anything in it!\" - Maniccam", "\"*Sigh*... now we are going to play god.\" - Maniccam", "\"I made a boo boo with my homework.\" - Maniccam", "\"It seems like you are just sitting there and typing things and you don't know what you are doing.\" - Tehranipour", "\"Seduce Manny\" - <@!355928972917211147>", "\"I'm starting to think I have very poor judgement\" - <@!206236569286344706>", "\"The usual three amigos\" - Maniccam", "\"This is my class. You're nobody.\" -Zhang", "\"Snuggling with the uhh... yeah\" - Maniccam", "\"Man this CSS doesn't want to go away\" - Maniccam", "\"It's kind of cute\" - Maniccam", "\"You have your usual suspects...\" - Maniccam (When talking about mathematical operators)", "\"Anyone going to the game?...of course not, you're computer science majors!\" -Francis", "\"Is anyone here like morally against pianos?\" -Francis", "\"We are going to get into some weird stuff. Might make you dizzy\" - Maniccam", "\"First of all, who cares?\" - Maniccam", "\"When you let everybody touch something.....\" - Maniccam", "\"This is not banana bread\" - <@!206236569286344706>", "\"Sorry, continue\" \"No\" - <@!355928972917211147> and Jiang", "Reminds me of one from our group's meeting. \"That's confusing\" - student, \"Yes\" - Jiang", "\"Manny will have you publicly executed if you dont print and scan the hw 🤦‍♂️ \" - <@206236569286344706>", "\"Faizan has a lot of balls\" - <@!223937816483069952>", "\"HTML doesn't want to give me a break today\" - Maniccam", "\"You don't have to learn what I'm going to teach you in the next 30 minutes\" - Maniccam", "\"You guys are very happy to leave early\" - Maniccam", "\"DID I SLEEP THROUGH A SHOOTING?!\" - <@745308946981453935>", "\"Why isn't that good?! Because I say so!\" -Zhang", "\"yep this is HDMI\" -Tehranipour (looking at thunderbolt)", "\"I dont understand this computer thing\" - Evett", "\"HTML is nice enough to let me go\" - Maniccam", "\"You guys are silent so I take it you don't believe me\" - Maniccam", "\"Using the internet means you didn't learn\" -Tehranipour", "\"When I first did online classes I hated it, I said I was gonna kill myself\" - Maniccam", "\"It should be stupid simple.. But most of the time it is just stupid\" - One of Brendan's students talking to other students", "\"This time I have a body with me\" - Maniccam", "\"I don't have a head\" - Maniccam", "\"Yea we are still here unfortunately\" - Maniccam", "\"If you want trouble I can show you where to find trouble\" - Maniccam", "\"You are just unlucky. You met me.\" -Zhang", "\"Pickle is a whore\" - <@776256478877057035>", "\"Let's make some errors\" - Maniccam", "\"They all have the same smell\" - Maniccam", "\"#AvoidEMU\" - <@!405098410757193729>", "\"Run the whole damn thing\" - Maniccam", "\"Where am I?\" - Maniccam", "\"Uhhhh..... yeah.\" - Maniccam", "\"Whatever you have. It's wrong.\" - Zhang", "\"Ask me questions while I work\" - Maniccam", "\"I'm the girl on the right with no braincells left\" - <@355928972917211147>", "\"I don't even know what email is.\" - Maniccam", "\"Ah oh we lost Tom\" - Maniccam", "\"If you know the rules you can't go wrong\" - Maniccam", "\"He deleted a cookie\" - Maniccam", "\"There is no cookie anywhere\" - Maniccam", "\"I'll email you some coffee\" - <@!295014270884904960>", "\"So.... no head?\" - Poh", "\"This semester is coming to a crashing halt and I am losing my mind\" - Maniccam", "\"Tom is giving us trouble, so let's try Mary\" - Maniccam", "\"Maybe my mom called me to come back home\" - Maniccam", "\"Uh oh, there's a dead body on the street. Clean it up.\" - Maniccam", "\"I don't expect anyone to fail unless you really want to fail\" - Maniccam", "\"Alright this is bye bye, bye bye\" - Maniccam", "\"Why are these random drugs on the ground bad for me?!\" - <@!295014270884904960>", "\"I found good drugs!\" - <@!295014270884904960>", "\"Highly motivated... passionate... blah blah blah\" - Manny", "\"I don't like this. I don't like this at all\" - Maniccam", "\"So you round up 3.84 and get... 9\" - Maniccam", "\"The force of the bed is too strong\" - <@295014270884904960>", "\"Statistics has become very sexy\" - Maniccam", "\"Am I missing something in Books 24x7, or is its UI tragic?\" - <@!667777839927394304>", "\"LOOK AT THE SIZE OF THAT HOLE...!\" - <@!295014270884904960>", "\"Stop touching me... Your ball was in the wayyy\" - <@!295014270884904960>", "\"Real programmers use punch cards\" - <@!532257014391373828>", "\"Rock and stone better for programming then plastic computer\" - <@!231832099232022528>", "\"I personally only program with a breadboard\" - <@!431114639821242369>", "\"Solder is my favorite programming language\" - Bob Pease, chip designer", " Testme-tets"], "makeMeLaugh": ["'I am actually fighting a king sized chicken nugget' - Lobo Justice League Action", "'Oh nothing I'm just talking to a disembodied professor that lives in my head' - Firestorm Justice League Action", "'Nope. No times no divided by no to the power of oh hell no' - Diblo How Not To Summon a Demon Lord", "'It's a beautiful day outside. Birds are singing, flowers are blooming. On days like this, kids like you should be burning in hell' - Discord Sings......Except Everyone Starts Singing Random Songs for Some Reason Part 3", "'Oh good my dog found the chainsaw' - Lilo and Stitch", "'Guard, fetch a stable boy quickly I've encountered a giant pile of bull droppings' - The Dragon Prince season 1 episode 5", "Breaks down door by taking it off with bear hands and eyes glowing red, 'Could you fetch your manager? I have a few complaints that need to be address personally' - Overlord season 2 episode 9", "'Does death count as trouble?' Overlord season 3 episode 7'What kind of fresh hell is this?' - Persona 4 Season 2 episode 7", "'Did you really think I'd die just because I was killed?' - Misfit of Demon King Academy", "'He's busy being a fool' 'What kind of fool?' 'The everything is now on fire kind' - HELLUVA BOSS - Loo Loo Land // S1: Episode 2", "'You still can't get out of bed in the morning?' 'No it holds me hostage' - The Asterisk War Season 1 episode 2", "'And how much crime am I gonna want to commit if there is even the slightest possible chance a naked dude will be running at me at Mach 3?' - Quirk Questions 6 (My Hero Academia Animation)", "'Oh yo homeboy looks like shark week I ain't messing with that' - Best of Nagisa (50% OFF)", "'Yo I said 8 hours minimum. If I don't get my beauty sleep I get real ugly real fast' - Best of Nagisa Part 2 Octopimp", "“Cornbread knows my sins, Henry. Cornbread knows what I have done, and he is here to make me atone' - Red, White, and Royal Blue by Casey McQuiston", "'Hey Yun, what's up?' 'What's up is my blood pressure' - Yona of the Dawn episode 10", "'This isn't war, it's pest control' - Doctor Who Tenth Doctor series", "''Arthur you keep chasing them on foot. I'll let you know where their shots come from' 'Well if you use tricky words like left or north I'm not gonna know what you're saying, so make sure you point okay?' 'It's like he's proud of how dumb he is' - Fire Force Season 1 episode 13", "'Sorry, it's egg time' - HoriMiya season 1 episode 1", "'There out there fighting for their lives and we're in here doing drugs' - Phasmophobia But It's Extremely Hard", "What mistake? Pink! - Sherlock A Study in Pink"]}