{"motivationalQuotes": ["https://tenor.com/view/do-it-star-wars-gif-4928619", "Push yourself, because no one else is going to do it for you.", "If you see a chance to be kind to someone tomorrow, take it. I think we need it. -Brad Pitt", "If you don't design your own life plan, chances are you'll fall into someone else's plan. And guess what they have planned for you? Not much.", "Life is 10% what happens to you and 90% how you react to it.", "Problems are not stop signs, they are guidelines. -Elon Musk", "If you fell down yesterday, stand up today. -H.G. Wells", "Education is the passport to the future, for tomorrow belongs to those who prepare for it today. — Malcolm X", "Education is the most powerful weapon you can use to change the world.", "A person who never made a mistake never tried anything new. — Albert Einstein", "Learning is never done without errors and defeat. – Vladimir Lenin", "Procrastination makes easy things hard and hard things harder.", "You don’t have to be great to start, but you have to start to be great.", "The way to get started is to quit talking and begin doing. – Walt Disney", "The best way to predict your future is to create it. —Abraham Lincoln", "The future belongs to those who believe in the beauty of their dreams. ― Eleanor Roosevelt", "You are braver than you believe, stronger than you seem and smarter than you think.", "Learn from yesterday. Live for today. Hope for tomorrow. – Albert Einstein", "He who asks a question is a fool for five minutes; he who does not ask a question remains a fool forever. — Chinese Proverb"], "makeMeLaugh": ["'I am actually fighting a king sized chicken nugget' - Lobo Justice League Action", "'Oh nothing I'm just talking to a disembodied professor that lives in my head' - Firestorm Justice League Action", "'Nope. No times no divided by no to the power of oh hell no' - Diblo How Not To Summon a Demon Lord", "'It's a beautiful day outside. Birds are singing, flowers are blooming. On days like this, kids like you should be burning in hell' - Discord Sings......Except Everyone Starts Singing Random Songs for Some Reason Part 3", "'Oh good my dog found the chainsaw' - Lilo and Stitch", "'Guard, fetch a stable boy quickly I've encountered a giant pile of bull droppings' - The Dragon Prince season 1 episode 5", "Breaks down door by taking it off with bear hands and eyes glowing red, 'Could you fetch your manager? I have a few complaints that need to be address personally' - Overlord season 2 episode 9", "'Does death count as trouble?' Overlord season 3 episode 7'What kind of fresh hell is this?' - Persona 4 Season 2 episode 7", "'Did you really think I'd die just because I was killed?' - Misfit of Demon King Academy", "'He's busy being a fool' 'What kind of fool?' 'The everything is now on fire kind' - HELLUVA BOSS - Loo Loo Land // S1: Episode 2", "'You still can't get out of bed in the morning?' 'No it holds me hostage' - The Asterisk War Season 1 episode 2", "'And how much crime am I gonna want to commit if there is even the slightest possible chance a naked dude will be running at me at Mach 3?' - Quirk Questions 6 (My Hero Academia Animation)", "'Oh yo homeboy looks like shark week I ain't messing with that' - Best of Nagisa (50% OFF)", "'Yo I said 8 hours minimum. If I don't get my beauty sleep I get real ugly real fast' - Best of Nagisa Part 2 Octopimp", "“Cornbread knows my sins, Henry. Cornbread knows what I have done, and he is here to make me atone' - Red, White, and Royal Blue by Casey McQuiston", "'Hey Yun, what's up?' 'What's up is my blood pressure' - Yona of the Dawn episode 10", "'This isn't war, it's pest control' - Doctor Who Tenth Doctor series", "''Arthur you keep chasing them on foot. I'll let you know where their shots come from' 'Well if you use tricky words like left or north I'm not gonna know what you're saying, so make sure you point okay?' 'It's like he's proud of how dumb he is' - Fire Force Season 1 episode 13", "'Sorry, it's egg time' - HoriMiya season 1 episode 1", "'There out there fighting for their lives and we're in here doing drugs' - Phasmophobia But It's Extremely Hard", "What mistake? Pink! - Sherlock A Study in Pink"]}